src/test/resources/apiXml/JLR/GetVehicleFile.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <getVehicleFile xmlns="http://www.cliffordthames.com/ebusiness/menus/">
         <vehicleFileRequest>
            <dealerDetails countryCode="GB" dealerIdentificationCode="Automation" languageCode="EN" manufacturer="JLR" password="O3Cg0d3l751" user="Automation" vehicleFileID="0"/>
         </vehicleFileRequest>
      </getVehicleFile>
   </soap:Body>
</soap:Envelope>